type FaqEntry = {
  question: string;
  answer: string;
};

export const FAQ_ENTRIES: FaqEntry[] = [
  {
    question: "Участь безкоштовна?",
    answer: "Так, участь у хакатоні абсолютно безкоштовна.",
  },
  {
    question: "Який рівень знань потрібен?",
    answer:
      "Достатньо базових навичок. Після реєстрації ти отримаєш тестове завдання, щоб ми могли оцінити твій рівень.",
  },
  {
    question: "Якою має бути команда?",
    answer:
      "Команда складається з 2–4 учасників. Не обов'язково всі мають бути розробниками — потрібні також дизайнери, менеджери, презентатори. Але рекомендуємо, щоб у команді був хоча б один розробник.",
  },
  {
    question: "Що робити, якщо немає команди?",
    answer: "Реєструйся! Ми додамо тебе в чат, де можна знайти однодумців.",
  },
  {
    question: "Чи можна брати участь онлайн?",
    answer: "Так, хакатон проходить у гібридному форматі — офлайн або онлайн.",
  },
  {
    question: "Скільки буде переможців і які призи?",
    answer:
      "У кожній категорії — три призових місця . Усі учасники отримають велком-паки, а переможці отримають призи від партнерів.",
  },
  {
    question: "Що робити під час повітряної тривоги?",
    answer:
      "Офлайн-учасники переходять в укриття поруч із локацією. Онлайн-учасники — будь ласка, подбайте про свою безпеку. Час хакатону не зупиняється.",
  },
  {
    question: "Що робити, якщо вимкнули світло?",
    answer:
      "Офлайн — локація забезпечена генераторами. \nОнлайн — підготуйте резервне живлення.",
  },
  {
    question: "Чи буде харчування для учасників?",
    answer: "Так, ми забезпечимо перекуси та напої.",
  },
  {
    question: "Чи можна брати участь онлайн?",
    answer: "Так, хакатон проходить у гібридному форматі — офлайн або онлайн.",
  },
  {
    question: "Залишились питання?",
    answer:
      'Напиши нам у Telegram 👉 <a href="https://t.me/INT20H_2026_Feedback_Bot" target="_blank" rel="noopener noreferrer" class="text-accent">@INT20H_2026_Feedback_Bot</a>',
  },
];
